
## Plan Result




<pre><code>Plan: 4 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.pcq_storage_account.azapi_update_resource.defender_settings
  * module.pcq_storage_account.time_rotating.rotate
  * module.pcq_storage_account.time_static.pim_expiry
  * module.pcq_storage_account.time_static.pim_start
* Update
  * module.pcq-consolidation-fail-action-group-slack-email.azurerm_resource_group_template_deployment.action-group
  * module.pcq-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.pcq-consolidation-fail-action-group-slack-email.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.Resources/deployments/pcq-alert"
        name                = "pcq-alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.pcq-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat|pcq-aat"
        name                           = "pcq-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.pcq_storage_account.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.Storage/storageAccounts/pcqsharedaat"
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.pcq_storage_account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.pcq_storage_account.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.pcq_storage_account.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 4 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":56,"Program":"tfcmt","SHA1":"","Vars":{}} -->